package com.zyb.functions.utils;

import com.github.javafaker.Faker;

public class Person {
    public static void main(String[] args) {
        Person person = new Person();
        for (int i = 0; i < 5; i++) {
            System.out.println(person.generateUserEmail());
        }
        System.out.println("----------");
        for (int i = 0; i < 5; i++) {
            System.out.println(person.generateCompanyName_en());
        }
    }

    /**
     * 生产中文姓名
     * @return
     */
    public String generateUserName(){
        String[] lastName = { "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "蒋", "沈", "韩", "杨", "朱", "秦", "许", "吕",
                "张", "孔", "曹", "严", "魏", "陶", "姜", "谢", "苏", "潘", "范", "彭", "鲁", "马", "苗", "任", "袁", "柳", "史", "唐", "薛",
                "雷", "贺", "倪", "汤", "罗", "郝", "安", "常", "乐", "齐", "康", "余", "元", "顾", "孟", "黄", "和", "姚", "汪", "祁", "毛",
                "宋", "庞", "纪", "屈", "项", "祝", "董", "梁", "杜", "麻", "强", "贾", "江", "郭", "梅", "林", "钟", "徐", "高", "夏", "蔡",
                "田", "胡", "万", "管", "莫", "邓", "洪", "包", "崔", "吉", "龚", "程", "陆", "曲", "封", "段", "富", "侯", "全", "秋", "宫",
                "祖", "武", "刘", "景", "龙", "叶", "司", "白", "索", "乔", "苍", "闻", "党", "牛", "农", "习", "鱼", "容", "向", "古", "易",
                "步", "满", "国", "文", "广", "东", "欧", "利", "隆", "师", "巩", "冷", "辛", "简", "空", "曾", "沙", "丰", "关", "游", "权",
                "公", "岳", "晋", "楚", "法", "商", "伯", "福", "南", "火", "铁", "官", "真", "展", "密", "敬", "高", "原", "仓", "阿", "门",
                "来", "风", "巨", "木", "京", "虎", "达", "竹", "皇", "司马", "上官", "欧阳", "夏侯", "诸葛", "东方", "皇甫", "公孙", "宇文", "长孙",
                "司徒" };

        String[] firstName = { "小明", "小芳", "玲玲", "聪", "羽", "波", "小刚", "爱梅", "志芳", "于光", "红", "伟", "秀英", "敏", "静", "丽",
                "强", "磊", "军", "洋洋", "勇", "艳", "杰", "娟", "涛", "秀兰", "平", "桂英", "丹", "林", "志刚", "壮壮","绍齐",  "博文",  "梓晨",
                "瑞霖",  "明哲",  "天翊",  "凯瑞",  "健雄",  "耀杰",  "潇然",  "子涵",  "越彬",  "钰轩",  "智辉",  "致远",  "俊驰",  "雨泽", "文昊",
                "修洁",  "黎昕",  "远航",  "旭尧",  "鸿涛",  "荣轩",  "越泽",  "浩宇",  "瑾瑜",  "皓轩",  "擎苍", "擎宇",  "志泽",  "子轩",  "弘文",
                "雨泽",  "建辉",  "晋鹏",  "天磊",  "绍辉",  "泽洋",  "鑫磊", "昊强",  "伟宸",  "博超",  "君浩",  "鹏涛",  "炎彬",  "鹤轩",  "越彬",
                "风华",  "靖琪",  "明辉",  "伟诚",  "明轩",  "健柏",  "修杰",  "志泽",  "弘文",  "峻熙",  "嘉懿",  "懿轩",  "苑博",  "伟泽",  "鸿煊",
                "博涛",  "智宸",  "正豪",  "昊然",  "明杰",  "立诚",  "立轩",  "立辉",  "峻熙",  "弘文", "昊天",  "思聪",  "展鹏",  "笑愚",  "志强",
                "炫明",  "雪松",  "思源",  "智渊",  "思淼",  "晓啸",  "天宇",  "浩然",  "文轩",  "鹭洋", "振家",  "乐驹",  "晓博",  "文博",  "昊焱",
                "立果",  "金鑫",  "锦程",  "嘉熙",  "鹏飞",  "子默",  "思远",  "浩轩",  "语堂",  "聪健", "明",  "文",  "果",  "思",  "鹏",  "驰",  "涛",
                "琪",  "浩",  "航",  "彬" };

        int lastNameIndex = (int) (Math.random() * lastName.length);
        int firstNameIndex = (int) (Math.random() * firstName.length);

        String name = lastName[lastNameIndex] + firstName[firstNameIndex];
        return name;
    }

    /**
     * 生成随机手机号
     *
     * @return
     */
    public String generateUserTel() {
        String[] telFirst = "130,131,132,133,134,135,136,137,138,139,147,150,151,152,153,158,159,170,171,172,173,175,176,177,178,180,181,182,183,184,185,186,187,188,189".split(",");
        int index = (int) (Math.random() * telFirst.length);
        int last = (int) (Math.random() * 90000000 + 10000000);
        String tel = telFirst[index] + last;
        return tel;
    }

    /**
     * 生成随机邮箱  11位随机字符+@+邮箱后缀
     * @return
     */
    public String generateUserEmail(){
        String email = "";
        String[] email_suffix_arr = {"163.com","qq.com","sina.com","sohu.com"};

//        String[] email_prefix_arr= {"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","0","1","2","3",
//                "4","5","6","7","8","9","_"};
        String[] email_prefix_arr= {"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"};
        StringBuilder sb = new StringBuilder();
        //生成随机邮箱前缀  @前面的内容
        for(int i=0;i<11;i++){
            int prefix_index = (int) (Math.random() * email_prefix_arr.length);
            sb.append(email_prefix_arr[prefix_index]);
            if(i==5){
                sb.append(".");
            }
        }
        int suffix_index = (int) (Math.random() * email_suffix_arr.length);
        return sb.toString() + "@" + email_suffix_arr[suffix_index];
    }

    /**
     * 随机生成中文公司名称
     * 名称的构成：公司名称一般有四部分组成：行政区划+字号+行业特点+组织形式。
     * 好听的公司名称：http://www.qunzou.com/ziliao/1968.html
     * @return
     */
    public String generateCompanyName(){
        //1.行政区划
        String[] area = {"上海","北京","武汉","郑州","安徽","杭州","广州","广东","陕西","山西","","宁波","吉林","长春","天津","银川","济南","南京","合肥","长沙","重庆",
                "成都","兰州","昆明","石家庄","新乡","贵阳","桂林","安阳","宝鸡","洛阳","平顶山","唐山","烟台","孝感"};
        //2.字号，由2个或以上的汉子组成
        String[] second  ={"艺博","捷诚","欣兴旺","台东泰","辉华","安安美","润耀","晶优","一胜","百名","万合晶","邦远","多春如","万晟","诺顿","凯干","益百永","丰辉欣","栩翔",
                "启明","荣彩","丰缘","白帆","公如聚","扬识","新东","捷飞","盈成","同进千","驰阳","和美","裕美","尊海","用磊","霸耀","浩美","亨鑫仁","永利","理京","明盛","信义",
                "本万飞","宝高","辉皇国","江晶","禄捷茂","绿欣苑","怡润","贵全","贝名","洪德成","同益","旋吉","合盛","勤裕鼎","尼鸿","皇源","啸创","索非亚皮革制品","聚美乐",
                "高如盈","宝驰五金","鸿泰","格领","东艾","森利","先卓","利晟","同通","富长盛","芯达","精典","尼佳","益复捷","生德","晶长","森益","金伙伴","德光","茂全","鲜派",
                "信顺康","龙丝","新耀协","佳丽","昇晖","佳洲","森道尔","皇祥千","润飞昌","福中荣","基玉","如和","茂乾","翔鹏","南湘","谦圣泰","吉春","如本寿","亚义金","源耀浩",
                "邦洁","宝复","洪进贵","永泰满","显郦","华行","韵仪","格派","晶佩","迪和","领速","贝耀","信华诚","世力","舜杰","久福","曼新","仁大兴","金祥元","泰伟飞","亚和金",
                "吉振","和伟中","盛金缘","立韦","宏久","吉至","曼展","天联","金涛","网诚","系广","圣金龙","易露发","嘉利华","聚顿","公同宏","威邦","力涛","恒蓝","铭航","中美公",
                "永逸","同捷","发和","易龙","汉金","干亚","翔洋","新都","茂进永","达通","娇罗","浩中和","东升","龙姿","隆新弘","鑫仟顺","越福","川实","中协吉","霸辉","洪谦","裕飞",
                "建富","华缘","三鑫","鑫旭","娇名","乾富隆","林霆","弘源高","荣子","九紫星","蓝珀","兴昌信","欧科","生锋","优义浩","泰满正","思之创","火嘉","理磊","湘华","名都",
                "威嘉","丰南区兆国","艾能","圣金龙","万码","攀枝花懋林","宏丰","新欧","汇万","大复","天影","玉基","康冠","大帆","凌雷","天天颖","伟庆成","佰盛","优益晶","春盈生",
                "千万巨","瑞凤","金永康","多优多","理识","本成优","寿旺鼎","频光","方元","千佳同","蚂蚁","高义兴","福泰","辰丰","兴新干","运易","荣祥","诚亚","五湖","欣圣干","冠坚",
                "拓嘉","欣祥本","坚源","成鼎","世雷","讯百","巨中进","赛苏","赢时","缘泰","荣裕","光升","东凯美","进百","名财","信多寿","复网","诗琴","近离","祥高佳","尼巨",
                "艾扬","兴燕","中輝","泰金","信美如","仕先","宏尔","南旺","浩宏","禄福台","阳恒","弘汇庆","罗全","高贵高","禾扬","汇达","开发区亚弘","美宏","康久美","云博",
                "昊天金诚","茂东富","巨吉","光长美","友尼","天友","鲜源","佳世盛","美乐家","旺生","飞恒多","美婷","鼎国裕","博睿精思","系圣","优长中","佳源","森鑫源","欧康","长康复",
                "山楼","健创","升阳","品臣","永盛公","鑫银","捷德","汇川","晖江","国安全","宇德","久长新","金佳","速拓科技","源好","复通飞","明精","祥新","优元","天大物贸","林德",
                "惠祥博达","妙硕","相祥","灵岛","公汇耀","领德","立缘","英基","生本","协庆顺","祥久","鼎铭","宝康多","合盛","蓝月","长成","华娜","禄弘","合众","长本","万坚","洁明",
                "干全和","中鼎寿","川京","木隆","炜烨","基名","寿金","同久富","频迈","晶胜","志诚","正金晶","圆和","辉春","元高","悦旋","昌佳佳","铁顺","世用","金百诚","天晶",
                "双川","多佳","福禄高","东威宏","耀胜","华安","欣凯裕","长如祥","威宜","茂安万","名维","企家","兴环宇","鑫爱","丰安利","民泰","锦程正阳","圆识","波菲特","振铁",
                "元欧","盛本荣","祥富源","同凯正","台同","森宇","锦秀","九桥","利达","春华长","泉州荣发","安全皇","谦合","圣尔","协贵满","财霸","雷傲","吕红发","玉诺","福顺德",
                "广荣","通特","乔东化工","康安","长惠","通丰弘","欣德","进广"};
        //3.行业特点：包括产品名称、行业名称或产业名称，如贸易、信息科技、广告、企业管理等
        String[] hangye = {"商贸","经贸","贸易","工贸","建筑工程","装饰装修","建材","房地产开发","道路桥梁","园林绿化","环保","卫生洁具","家政","咨询","中介","停车管理",
                "搬家","餐饮","旅游","山庄","渡假村","疗养","夜总会","歌舞厅","酒吧","广告","传媒","科技","院校","医院","药品","医疗器械","健身器材","高尔夫"};
        //4.组织形式：有限公司、股份有限公司、集团有限公司等
        String[] zuZhi = {"股份有限公司","有限责任公司","有限公司"};

        int index1 = (int) (Math.random() * area.length);
        int index2 = (int) (Math.random() * second.length);
        int index3 = (int) (Math.random() * hangye.length);
        int index4 = (int) (Math.random() * zuZhi.length);

        return area[index1] + second[index2] + hangye[index3] + zuZhi[index4];
    }

    /**
     * 利用faker生成英文公司名称，
     * javafaker生成中文公司名字有点弱，生成英文的时候再用吧,python中生成中文公司名称看着很舒服
     * @return
     */
    public String generateCompanyName_en(){
        Faker faker = new Faker();
        return faker.company().name();
    }

}
